[{"title": "On Background Bias in Deep Metric Learning", "authors": ["Konstantin Kobs", "A. Hotho"], "abstract": "Deep Metric Learning trains a neural network to map input images to a lower-dimensional embedding space such that similar images are closer together than dissimilar images. When used for item retrieval, a query image is embedded using the trained model and the closest items from a database storing their respective embeddings are returned as the most similar items for the query. Especially in product retrieval, where a user searches for a certain product by taking a photo of it, the image background is usually not important and thus should not inﬂuence the embedding process. Ideally, the retrieval process always returns ﬁtting items for the photographed object, regardless of the environment the photo was taken in. In this paper, we analyze the inﬂuence of the image background on Deep Metric Learning models by utilizing ﬁve common loss functions and three common datasets. We ﬁnd that Deep Metric Learning networks are prone to so-called background bias, which can lead to a severe decrease in retrieval performance when changing the image background during inference. We also show that replacing the background of images during training with random background images alleviates this issue. Since we use an automatic background removal method to do this background replacement, no additional manual labeling work and model changes are required while inference time stays the same. Qualitative and quantitative analyses, for which we introduce a new evaluation metric, conﬁrm that models trained with replaced backgrounds attend more to the main object in the image, beneﬁtting item retrieval systems.", "venue": "", "year": 2022, "publicationDate": "2022-10-04", "url": "https://www.semanticscholar.org/paper/dda1062bc212583ad6a5e9e09de109fd0c86d0ea"}, {"title": "WueDevils at SemEval-2022 Task 8: Multilingual News Article Similarity via Pair-Wise Sentence Similarity Matrices", "authors": ["Dirk Wangsadirdja", "Felix Heinickel", "Simon Trapp", "Albin Zehe", "Konstantin Kobs", "A. Hotho"], "abstract": "We present a system that creates pair-wise cosine and arccosine sentence similarity matrices using multilingual sentence embeddings obtained from pre-trained SBERT and Universal Sentence Encoder (USE) models respectively. For each news article sentence, it searches the most similar sentence from the other article and computes an average score. Further, a convolutional neural network calculates a total similarity score for the article pairs on these matrices. Finally, a random forest regressor merges the previous results to a final score that can optionally be extended with a publishing date score.", "venue": "SEMEVAL", "year": 2022, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/eb5e149afc25f1b1464090587ab62b49a98b7ff8"}, {"title": "LSX_team5 at SemEval-2022 Task 8: Multilingual News Article Similarity Assessment based on Word- and Sentence Mover’s Distance", "authors": ["Stefan Heil", "Karina Kopp", "Albin Zehe", "Konstantin Kobs", "A. Hotho"], "abstract": "This paper introduces our submission for the SemEval 2022 Task 8: Multilingual News Article Similarity. The task of the competition consisted of the development of a model, capable of determining the similarity between pairs of multilingual news articles. To address this challenge, we evaluated the Word Mover’s Distance in conjunction with word embeddings from ConceptNet Numberbatch and term frequencies of WorldLex, as well the Sentence Mover’s Distance based on sentence embeddings generated by pretrained transformer models of Sentence-BERT. To facilitate the comparison of multilingual articles with Sentence-BERT models, we deployed a Neural Machine Translation system. All our models achieve stable results in multilingual similarity estimation without learning parameters.", "venue": "SEMEVAL", "year": 2022, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/edf0951a9148fe9b621473a68f0b44b3d3430b31"}, {"title": "CoBERT: Scientific Collaboration Prediction via Sequential Recommendation", "authors": ["Tobias Koopmann", "Konstantin Kobs", "Konstantin Herud", "A. Hotho"], "abstract": "Collaborations are an Important factor for scientific success, as the joint work leads to results individual scientists cannot easily reach. Recommending collaborations automatically can alleviate the time consuming and tedious search for potential collaborators. Usually, such recommendation systems rely on graph structures modeling co-authorship of papers and content-based relations such as similar paper keywords. Models are then trained to estimate the probability of links between certain authors in these graphs.In this paper, we argue that the order of papers is crucial for reliably predicting future collaborations, which is not considered by graph-based recommendation systems. We thus propose to reformulate the task of collaboration recommendation as a sequential recommendation task. Here, we aim to predict the next co-author in a chronologically sorted sequence of an author’s collaborators. We introduce CoBERT, a BERT4Rec inspired model, that predicts the sequence’s next co-author and thus a potential collaborator. Since the order of co-authors of a single paper is not that important compared to the overall paper order, we leverage positional embeddings encoding paper positions instead of co-author positions in the sequence. Additionally, we inject content features about every paper and their co-authors. We evaluate CoBERT on two datasets consisting of papers from the field of Artificial Intelligence and the journal PlosOne. We show that CoBERT can outperform graph-based methods and BERT4Rec when predicting the co-authors of the next paper. We make our code and data available.", "venue": "2021 International Conference on Data Mining Workshops (ICDMW)", "year": 2021, "publicationDate": "2021-12-01", "url": "https://www.semanticscholar.org/paper/1980f7230a4c1871cedc856ce836b8d1f62d10e8"}, {"title": "Density-based weighting for imbalanced regression", "authors": ["M. Steininger", "Konstantin Kobs", "Padraig Davidson", "Anna Krause", "A. Hotho"], "abstract": null, "venue": "Mach. Learn.", "year": 2021, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/5e35f17cc6e37ab83f3019d7e86b7dd13a892c55"}, {"title": "Do Different Deep Metric Learning Losses Lead to Similar Learned Features?", "authors": ["Konstantin Kobs", "M. Steininger", "Andrzej Dulny", "A. Hotho"], "abstract": "Recent studies have shown that many deep metric learning loss functions perform very similarly under the same experimental conditions. One potential reason for this unexpected result is that all losses let the network focus on similar image regions or properties. In this paper, we investigate this by conducting a two-step analysis to extract and compare the learned visual features of the same model architecture trained with different loss functions: First, we compare the learned features on the pixel level by correlating saliency maps of the same input images. Second, we compare the clustering of embeddings for several image properties, e.g. object color or illumination. To provide independent control over these properties, photo-realistic 3D car renders similar to images in the Cars196 dataset are generated. In our analysis, we compare 14 pretrained models from a recent study and find that, even though all models perform similarly, different loss functions can guide the model to learn different features. We especially find differences between classification and ranking based losses. Our analysis also shows that some seemingly irrelevant properties can have significant influence on the resulting embedding. We encourage researchers from the deep metric learning community to use our methods to get insights into the features learned by their proposed methods.", "venue": "2021 IEEE/CVF International Conference on Computer Vision (ICCV)", "year": 2021, "publicationDate": "2021-10-01", "url": "https://www.semanticscholar.org/paper/9d477fd3e43d29e54517e0b4e13cb1ccd20be469"}, {"title": "Self-Supervised Multi-Task Pretraining Improves Image Aesthetic Assessment", "authors": ["Jan Pfister", "Konstantin Kobs", "A. Hotho"], "abstract": "Neural networks for Image Aesthetic Assessment are usually initialized with weights of pretrained ImageNet models and then trained using a labeled image aesthetics dataset. We argue that the ImageNet classification task is not well-suited for pretraining, since content based classification is designed to make the model invariant to features that strongly influence the image’s aesthetics, e.g. stylebased features such as brightness or contrast.We propose to use self-supervised aesthetic-aware pretext tasks that let the network learn aesthetically relevant features, based on the observation that distorting aesthetic images with image filters usually reduces their appeal. To ensure that images are not accidentally improved when filters are applied, we introduce a large dataset comprised of highly aesthetic images as the starting point for the distortions. The network is then trained to rank less distorted images higher than their more distorted counterparts. To exploit effects of multiple different objectives, we also embed this task into a multi-task setting by adding either a self-supervised classification or regression task. In our experiments, we show that our pretraining improves performance over the ImageNet initialization and reduces the number of epochs until convergence by up to 47%. Additionally, we can match the performance of an ImageNet-initialized model while reducing the labeled training data by 20%. We make our code, data, and pretrained models available.", "venue": "2021 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW)", "year": 2021, "publicationDate": "2021-06-01", "url": "https://www.semanticscholar.org/paper/e9f52050e8420cb3e1d215dcdf64d165c7508c12"}, {"title": "MapLUR: Exploring a new Paradigm for Estimating Air Pollution using Deep Learning on Map Images", "authors": ["M. Steininger", "Konstantin Kobs", "Albin Zehe", "Florian Lautenschlager", "Martin Becker", "A. Hotho"], "abstract": "Land-use regression (LUR) models are important for the assessment of air pollution concentrations in areas without measurement stations. While many such models exist, they often use manually constructed features based on restricted, locally available data. Thus, they are typically hard to reproduce and challenging to adapt to areas beyond those they have been developed for. In this paper, we advocate a paradigm shift for LUR models: We propose the Data-driven, Open, Global (DOG) paradigm that entails models based on purely data-driven approaches using only openly and globally available data. Progress within this paradigm will alleviate the need for experts to adapt models to the local characteristics of the available data sources and thus facilitate the generalizability of air pollution models to new areas on a global scale. In order to illustrate the feasibility of the DOG paradigm for LUR, we introduce a deep learning model called MapLUR. It is based on a convolutional neural network architecture and is trained exclusively on globally and openly available map data without requiring manual feature engineering. We compare our model to state-of-the-art baselines like linear regression, random forests and multi-layer perceptrons using a large data set of modeled $\\text{NO}_2$ concentrations in Central London. Our results show that MapLUR significantly outperforms these approaches even though they are provided with manually tailored features. Furthermore, we illustrate that the automatic feature extraction inherent to models based on the DOG paradigm can learn features that are readily interpretable and closely resemble those commonly used in traditional LUR approaches.", "venue": "ACM Trans. Spatial Algorithms Syst.", "year": 2020, "publicationDate": "2020-02-18", "url": "https://www.semanticscholar.org/paper/04b4ab09cfed4ce8e534685bc49dedbf8fe81b18"}, {"title": "Emote-Controlled", "authors": ["Konstantin Kobs", "Albin Zehe", "Armin Bernstetter", "Julian Chibane", "J. Pfister", "Julian Tritscher", "A. Hotho"], "abstract": "In recent years, streaming platforms for video games have seen increasingly large interest, as so-called esports have developed into a lucrative branch of business. Like for other sports, watching esports has become a new kind of entertainment medium, which is possible due to platforms that allow gamers to live stream their gameplay, the most popular platform being Twitch.tv. On these platforms, users can comment on streams in real time and thereby express their opinion about the events in the stream. Due to the popularity of Twitch.tv, this can be a valuable source of feedback for streamers aiming to improve their reception in a gaming-oriented audience. In this work, we explore the possibility of deriving feedback for video streams on Twitch.tv by analyzing the sentiment of live text comments made by stream viewers in highly active channels. Automatic sentiment analysis on these comments is a challenging task, as one can compare the language used in Twitch.tv with that used by an audience in a stadium, shouting as loud as possible in sometimes nonorganized ways. This language is very different from common English, mixing Internet slang and gaming-related language with abbreviations, intentional and unintentional grammatical and orthographic mistakes, and emoji-like images called emotes. Classic lexicon-based sentiment analysis techniques therefore fail when applied to Twitch comments. To overcome the challenge posed by the nonstandard language, we propose two unsupervised lexicon-based approaches that make heavy use of the information encoded in emotes, as well as a weakly supervised neural network–based classifier trained on the lexicon-based outputs, which is supposed to help generalization to unknown words by use of domain-specific word embeddings. To enable better understanding of Twitch.tv comments, we analyze a large dataset of comments, uncovering specific properties of their language, and provide a smaller set of comments labeled with sentiment information by crowdsourcing. We present two case studies showing the effectiveness of our methods in generating sentiment trajectories for events live streamed on Twitch.tv that correlate well with specific topics in the given stream. This allows for a new kind of implicit real-time feedback gathering for Twitch streamers and companies producing games or streaming content on Twitch. We make our datasets and code publicly available for further research.1", "venue": "ACM Trans. Soc. Comput.", "year": 2020, "publicationDate": "2020-04-19", "url": "https://www.semanticscholar.org/paper/3c9a6db8d70d712493196c5718cc1e8a116332d2"}, {"title": "OpenLUR: Off-the-shelf air pollution modeling with open features and machine learning", "authors": ["Florian Lautenschlager", "Martin Becker", "Konstantin Kobs", "M. Steininger", "Padraig Davidson", "Anna Krause", "A. Hotho"], "abstract": null, "venue": "Atmospheric Environment", "year": 2020, "publicationDate": "2020-07-01", "url": "https://www.semanticscholar.org/paper/6eee4f33a3ef6dcdafead44f011e8a0e7c554b18"}, {"title": "MapLUR", "authors": ["M. Steininger", "Konstantin Kobs", "Albin Zehe", "Florian Lautenschlager", "Martin Becker", "A. Hotho"], "abstract": "Land-use regression (LUR) models are important for the assessment of air pollution concentrations in areas without measurement stations. While many such models exist, they often use manually constructed features based on restricted, locally available data. Thus, they are typically hard to reproduce and challenging to adapt to areas beyond those they have been developed for. In this article, we advocate a paradigm shift for LUR models: We propose the Data-driven, Open, Global (DOG) paradigm that entails models based on purely data-driven approaches using only openly and globally available data. Progress within this paradigm will alleviate the need for experts to adapt models to the local characteristics of the available data sources and thus facilitate the generalizability of air pollution models to new areas on a global scale. To illustrate the feasibility of the DOG paradigm for LUR, we introduce a deep-learning model called MapLUR. It is based on a convolutional neural network architecture and is trained exclusively on globally and openly available map data without requiring manual feature engineering. We compare our model to state-of-the-art baselines like linear regression, random forests and multi-layer perceptrons using a large data set of modeled NO2 concentrations in Central London. Our results show that MapLUR significantly outperforms these approaches even though they are provided with manually tailored features. Furthermore, we illustrate that the automatic feature extraction inherent to models based on the DOG paradigm can learn features that are readily interpretable and closely resemble those commonly used in traditional LUR approaches.", "venue": "", "year": 2020, "publicationDate": "2020-04-13", "url": "https://www.semanticscholar.org/paper/6f36fdb9ac3367ca7e73d65274b3dee38c6181f7"}, {"title": "NICER: Aesthetic Image Enhancement with Humans in the Loop", "authors": ["Michael Fischer", "Konstantin Kobs", "A. Hotho"], "abstract": "Fully- or semi-automatic image enhancement software helps users to increase the visual appeal of photos and does not require in-depth knowledge of manual image editing. However, fully-automatic approaches usually enhance the image in a black-box manner that does not give the user any control over the optimization process, possibly leading to edited images that do not subjectively appeal to the user. Semi-automatic methods mostly allow for controlling which pre-defined editing step is taken, which restricts the users in their creativity and ability to make detailed adjustments, such as brightness or contrast. We argue that incorporating user preferences by guiding an automated enhancement method simplifies image editing and increases the enhancement's focus on the user. This work thus proposes the Neural Image Correction & Enhancement Routine (NICER), a neural network based approach to no-reference image enhancement in a fully-, semi-automatic or fully manual process that is interactive and user-centered. NICER iteratively adjusts image editing parameters in order to maximize an aesthetic score based on image style and content. Users can modify these parameters at any time and guide the optimization process towards a desired direction. This interactive workflow is a novelty in the field of human-computer interaction for image enhancement tasks. In a user study, we show that NICER can improve image aesthetics without user interaction and that allowing user interaction leads to diverse enhancement outcomes that are strongly preferred over the unedited image. We make our code publicly available to facilitate further research in this direction.", "venue": "ArXiv", "year": 2020, "publicationDate": "2020-12-03", "url": "https://www.semanticscholar.org/paper/7e3169f1306cbcc99195e203cfdf52e500841f73"}, {"title": "Where to Submit? Helping Researchers to Choose the Right Venue", "authors": ["Konstantin Kobs", "Tobias Koopmann", "Albin Zehe", "David Fernes", "Philipp Krop", "A. Hotho"], "abstract": "Whenever researchers write a paper, the same question occurs: “Where to submit?” In this work, we introduce WTS, an open and interpretable NLP system that recommends conferences and journals to researchers based on the title, abstract, and/or keywords of a given paper. We adapt the TextCNN architecture and automatically analyze its predictions using the Integrated Gradients method to highlight words and phrases that led to the recommendation of a scientific venue. We train and test our method on publications from the fields of artificial intelligence (AI) and medicine, both derived from the Semantic Scholar dataset. WTS achieves an Accuracy@5 of approximately 83% for AI papers and 95% in the field of medicine. It is open source and available for testing on https://wheretosubmit.ml.", "venue": "FINDINGS", "year": 2020, "publicationDate": "2020-11-01", "url": "https://www.semanticscholar.org/paper/823fe97a65f34abbc60f33179751b808ce60919f"}, {"title": "Improving Sentiment Analysis with Biofeedback Data", "authors": ["Daniel Schlör", "Albin Zehe", "Konstantin Kobs", "Blerta Veseli", "Franziska Westermeier", "Larissa Brübach", "D. Roth", "M. Latoschik", "A. Hotho"], "abstract": "Humans frequently are able to read and interpret emotions of others by directly taking verbal and non-verbal signals in human-to-human communication into account or to infer or even experience emotions from mediated stories. For computers, however, emotion recognition is a complex problem: Thoughts and feelings are the roots of many behavioural responses and they are deeply entangled with neurophysiological changes within humans. As such, emotions are very subjective, often are expressed in a subtle manner, and are highly depending on context. For example, machine learning approaches for text-based sentiment analysis often rely on incorporating sentiment lexicons or language models to capture the contextual meaning. This paper explores if and how we further can enhance sentiment analysis using biofeedback of humans which are experiencing emotions while reading texts. Specifically, we record the heart rate and brain waves of readers that are presented with short texts which have been annotated with the emotions they induce. We use these physiological signals to improve the performance of a lexicon-based sentiment classifier. We find that the combination of several biosignals can improve the ability of a text-based classifier to detect the presence of a sentiment in a text on a per-sentence level.", "venue": "ONION", "year": 2020, "publicationDate": "2020-05-01", "url": "https://www.semanticscholar.org/paper/8a48b907c489bc78e4b67d56cdc11f3449d6aa4c"}, {"title": "Towards Predicting the Subscription Status of Twitch.tv Users - ECML-PKDD ChAT Discovery Challenge 2020", "authors": ["Konstantin Kobs", "Martin Potthast", "Matti Wiegmann", "Albin Zehe", "Benno Stein", "A. Hotho"], "abstract": "We investigate whether the subscription status of active users of Twitch can be inferred from their activity patterns in the chats of streamers. To enable a diversity of solutions to this problem, this task was advertised as an ECML-PKDD discovery challenge 2020, called Chat Analytics for Twitch (ChAT). Four participants submitted their working prediction models, which were evaluated at our site. The winning approach achieved an F1 score of 0.343, outperforming the baseline by a significant margin. The most salient conclusion that can be drawn at this time is that interaction behavior plays a crucial role in solving this task, meriting further analysis into this direction.", "venue": "ChAT@PKDD/ECML", "year": 2020, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/8bdaba2ce673c8fe167911de05345570508948f6"}, {"title": "Anomaly Detection in Beehives using Deep Recurrent Autoencoders", "authors": ["Padraig Davidson", "M. Steininger", "Florian Lautenschlager", "Konstantin Kobs", "Anna Krause", "A. Hotho"], "abstract": "Precision beekeeping allows to monitor bees' living conditions by equipping beehives with sensors. The data recorded by these hives can be analyzed by machine learning models to learn behavioral patterns of or search for unusual events in bee colonies. One typical target is the early detection of bee swarming as apiarists want to avoid this due to economical reasons. Advanced methods should be able to detect any other unusual or abnormal behavior arising from illness of bees or from technical reasons, e.g. sensor failure. \nIn this position paper we present an autoencoder, a deep learning model, which detects any type of anomaly in data independent of its origin. Our model is able to reveal the same swarms as a simple rule-based swarm detection algorithm but is also triggered by any other anomaly. We evaluated our model on real world data sets that were collected on different hives and with different sensor setups.", "venue": "SENSORNETS", "year": 2020, "publicationDate": "2020-03-10", "url": "https://www.semanticscholar.org/paper/8ebb7016c8a6015133d7ae53a6724b861d11b19b"}, {"title": "Semi-Supervised Learning for Grain Size Distribution Interpolation", "authors": ["Konstantin Kobs", "Christian Schäfer", "M. Steininger", "Anna Krause", "R. Baumhauer", "H. Paeth", "A. Hotho"], "abstract": null, "venue": "ICPR Workshops", "year": 2020, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/91f878d40677036f5e0eb56d6fde2f8b934e981b"}, {"title": "SimLoss: Class Similarities in Cross Entropy", "authors": ["Konstantin Kobs", "M. Steininger", "Albin Zehe", "Florian Lautenschlager", "A. Hotho"], "abstract": null, "venue": "ISMIS", "year": 2020, "publicationDate": "2020-03-06", "url": "https://www.semanticscholar.org/paper/ee762a21f3e593794a3615a8a9a9e30470d97643"}, {"title": "1 Emote-Controlled Obtaining Implicit Viewer Feedback through Emote based Sentiment Analysis on Comments of Popular Twitch . tv Channels", "authors": ["Konstantin Kobs", "Albin Zehe", "Armin Bernstetter", "Julian Chibane", "Jan", "Pfister"], "abstract": null, "venue": "", "year": null, "publicationDate": null, "url": "https://www.semanticscholar.org/paper/d3f8464fa468cc2693175b25af6ecde82c715c39"}]